src/test/java/DataFiles/OrgReport_OrgName.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:lnrisk:ws:wshealthcare:(internal)@ver=${#Project#ver}2.41">
    <soapenv:Header/>
    <soapenv:Body>
        <urn:OrganizationReportRequest>
            <!--You may enter the following 6 items in any order-->
            <!--Optional:-->
            <urn:User>
                <!--You may enter the following 41 items in any order-->
                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->
                <urn:ExcludeDMVPII>true</urn:ExcludeDMVPII>
                <!--Optional:-->

                <!--Optional:-->
                <urn:DataRestrictionMask>${DRM_NO_RESTRICT_ALL}</urn:DataRestrictionMask>
                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->
                <urn:DataPermissionMask>${DPM_ALL}</urn:DataPermissionMask><urn:LnBranded>false</urn:LnBranded>
                <!--Optional:-->
                <urn:EndUser>
                    <!--You may enter the following 6 items in any order-->
                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                </urn:EndUser>
                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

            </urn:User>
            <!--Optional:-->
            <urn:RemoteLocations>
                <!--Zero or more repetitions:-->
                <urn:Item/>
            </urn:RemoteLocations>
            <!--Optional:-->
            <urn:ServiceLocations>
                <!--Zero or more repetitions:-->
                <urn:ServiceLocation>
                    <!--You may enter the following 3 items in any order-->
                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->
                    <urn:Parameters>
                        <!--Zero or more repetitions:-->
                        <urn:Parameter>
                            <!--You may enter the following 2 items in any order-->
                            <!--Optional:-->

                            <!--Optional:-->

                        </urn:Parameter>
                    </urn:Parameters>
                </urn:ServiceLocation>
            </urn:ServiceLocations>
            <!--Optional:-->
            <urn:HealthcareConfig>
                <!--You may enter the following 2 items in any order-->
                <!--Optional:-->

                <!--Optional:-->

            </urn:HealthcareConfig>
            <!--Optional:-->
            <urn:Options>
                <urn:IncludeNPI>1</urn:IncludeNPI>
                <urn:IncludeNCPDP>1</urn:IncludeNCPDP>
                <!--You may enter the following 33 items in any order-->
                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <urn:ReturnCount>50</urn:ReturnCount><urn:StartingRecord>1</urn:StartingRecord><urn:SuppressLicenseHistory>true</urn:SuppressLicenseHistory><urn:BestRules>HMS</urn:BestRules></urn:Options>
            <!--Optional:-->
            <urn:ReportBy>
                <!--You may enter the following 29 items in any order-->
                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->
                <urn:BusinessIds>
                    <!--You may enter the following 7 items in any order-->
                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                    <!--Optional:-->

                </urn:BusinessIds>
                <!--Optional:-->

                <!--Optional:-->
                <urn:OrganizationName>MAYO</urn:OrganizationName><urn:Address>
                <!--You may enter the following 18 items in any order-->
                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

            </urn:Address>
                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->
                <urn:Licenses>
                    <!--Zero or more repetitions:-->
                    <urn:License>
                        <!--You may enter the following 3 items in any order-->
                        <!--Optional:-->

                        <!--Optional:-->

                        <!--Optional:-->

                    </urn:License>
                </urn:Licenses>
                <!--Optional:-->

                <!--Optional:-->
                <urn:DEANumbers>
                    <!--Zero or more repetitions:-->
                    <urn:DEANumber/>
                </urn:DEANumbers>
                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->
                <urn:Taxonomies>
                    <!--Zero or more repetitions:-->
                    <urn:Taxonomy/>
                </urn:Taxonomies>
                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->

                <!--Optional:-->
                <urn:LegacyIds>
                    <!--Zero or more repetitions:-->
                    <urn:LegacyId>
                        <!--You may enter the following 2 items in any order-->
                        <!--Optional:-->

                        <!--Optional:-->

                    </urn:LegacyId>
                </urn:LegacyIds>
                <!--Optional:-->

                <!--Optional:-->

            </urn:ReportBy>
        </urn:OrganizationReportRequest>
    </soapenv:Body>
</soapenv:Envelope>